app/controllers/comments_controller.rb

	def create
		line = Line.find(params[:comment][:line_id])
		line.comments.create(content: params[:comment][:content])
---
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "created_at", "line_id", "updated_at", "votes") VALUES (?, ?, ?, ?, ?)  [["content", "あ"], ["created_at", "2014-08-11 17:41:06.947401"], ["line_id", 1], ["updated_at", "2014-08-11 17:41:06.947401"], ["votes", 0]]

	def upvote
		comment = Comment.find(params[:id])
		comment.votes += 1
		comment.save
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "comments" SET "updated_at" = ?, "votes" = ? WHERE "comments"."id" = 1  [["updated_at", "2014-08-11 17:48:46.267451"], ["votes", 1]]

	def downvote
		comment = Comment.find(params[:id])
		comment.votes -= 1
		comment.save
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "comments" SET "updated_at" = ?, "votes" = ? WHERE "comments"."id" = 2  [["updated_at", "2014-08-11 18:10:32.261176"], ["votes", -1]]