app/controllers/general_comments_controller.rb

	def create
		GeneralComment.create(content: params[:general_comment][:content])
---
INSERT INTO "general_comments" ("content", "created_at", "updated_at", "votes") VALUES (?, ?, ?, ?)  [["content", "あいう"], ["created_at", "2014-08-12 03:47:44.604005"], ["updated_at", "2014-08-12 03:47:44.604005"], ["votes", 0]]

	def upvote
		general_comment = GeneralComment.find(params[:id])
		general_comment.votes += 1
		general_comment.save
---
SELECT  "general_comments".* FROM "general_comments"  WHERE "general_comments"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "general_comments" SET "updated_at" = ?, "votes" = ? WHERE "general_comments"."id" = 4  [["updated_at", "2014-08-12 03:42:18.014346"], ["votes", 1]]

	def downvote
		general_comment = GeneralComment.find(params[:id])
		general_comment.votes -= 1
		general_comment.save
---
SELECT  "general_comments".* FROM "general_comments"  WHERE "general_comments"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "general_comments" SET "updated_at" = ?, "votes" = ? WHERE "general_comments"."id" = 4  [["updated_at", "2014-08-12 03:42:20.920306"], ["votes", 0]]