app/controllers/home_controller.rb

SELECT "lines".* FROM "lines"
SELECT "comments".* FROM "comments"
SELECT "general_comments".* FROM "general_comments"
---
	def index
		@lines = Line.all
		@comment = Comment.new
		@comments = Comment.all
		@comments = @comments.sort_by &:id
		@general_comment = GeneralComment.new
		@general_comments = GeneralComment.all