app/controllers/lines_controller.rb

	def upvote
		line = Line.find(params[:id])
		line.votes += 1
		line.save
---
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "lines" SET "updated_at" = ?, "votes" = ? WHERE "lines"."id" = 1  [["updated_at", "2014-08-11 17:48:43.277714"], ["votes", 1]]

	def downvote
		line = Line.find(params[:id])
		line.votes -= 1
		line.save
---
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "lines" SET "updated_at" = ?, "votes" = ? WHERE "lines"."id" = 1  [["updated_at", "2014-08-11 17:48:44.876892"], ["votes", 1]]